Revit 2027 API
DuctSettings.RoundDuctSizeSuffix Property
 The round duct size suffix string.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string RoundDuctSizeSuffix { get; set; }
Public Property RoundDuctSizeSuffix As String
	Get
	Set
public:
property String^ RoundDuctSizeSuffix {
	String^ get ();
	void set (String^ value);
}
member RoundDuctSizeSuffix : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace